PromisePayDotNet.Tests/Fixtures/items_delete.json

{"items":{"id":"db3d95aa-2e35-4d87-95b4-5c9b41ba7346","name":"Test Item #1","description":"Test item #1 description","created_at":"2015-08-11T18:12:23.096Z","updated_at":"2015-08-11T18:12:24.490Z","state":"cancelled","net_amount":1000,"refunded_amount":0,"released_amount":0,"buyer_fees":0,"seller_fees":0,"credit_card_fee":0,"deposit_reference":"9140152717","payment_type_id":2,"status":22575,"amount":1000,"pending_release_amount":0,"promisepay_fee":17,"total_outstanding":1000,"currency":"AUD","payment_method":"pending","buyer_name":"Test Test","buyer_email":"aaa@bbb.com","buyer_country":"AUS","seller_name":"Test Test","seller_email":"fdf58725-96bd-4bf8-b5e6-9b61be20662e@google.com","seller_country":"AUS","related":{"buyers":"ec9bf096-c505-4bef-87f6-18822b9dbf2c","sellers":"fdf58725-96bd-4bf8-b5e6-9b61be20662e"},"links":{"self":"/items/db3d95aa-2e35-4d87-95b4-5c9b41ba7346","buyers":"/items/db3d95aa-2e35-4d87-95b4-5c9b41ba7346/buyers","sellers":"/items/db3d95aa-2e35-4d87-95b4-5c9b41ba7346/sellers","status":"/items/db3d95aa-2e35-4d87-95b4-5c9b41ba7346/status","fees":"/items/db3d95aa-2e35-4d87-95b4-5c9b41ba7346/fees","transactions":"/items/db3d95aa-2e35-4d87-95b4-5c9b41ba7346/transactions","wire_details":"/items/db3d95aa-2e35-4d87-95b4-5c9b41ba7346/wire_details","bpay_details":"/items/db3d95aa-2e35-4d87-95b4-5c9b41ba7346/bpay_details"}}}