PromisePayDotNet.Tests/Fixtures/items_edit.json

{"items":{"id":"172500df-0f2a-4e43-8fe7-f4a36dfbd1a2","name":"Test123","description":"Test123","created_at":"2015-08-11T18:17:01.391Z","updated_at":"2015-08-11T18:17:02.116Z","state":"pending","net_amount":1000,"refunded_amount":0,"released_amount":0,"buyer_fees":0,"seller_fees":0,"credit_card_fee":0,"deposit_reference":"9140152735","payment_type_id":2,"status":22000,"amount":1000,"pending_release_amount":0,"promisepay_fee":17,"total_outstanding":1000,"currency":"AUD","payment_method":"pending","buyer_name":"Test Test","buyer_email":"aaa@bbb.com","buyer_country":"AUS","seller_name":"Test Test","seller_email":"fdf58725-96bd-4bf8-b5e6-9b61be20662e@google.com","seller_country":"AUS","related":{"buyers":"ec9bf096-c505-4bef-87f6-18822b9dbf2c","sellers":"fdf58725-96bd-4bf8-b5e6-9b61be20662e"},"links":{"self":"/items/172500df-0f2a-4e43-8fe7-f4a36dfbd1a2","buyers":"/items/172500df-0f2a-4e43-8fe7-f4a36dfbd1a2/buyers","sellers":"/items/172500df-0f2a-4e43-8fe7-f4a36dfbd1a2/sellers","status":"/items/172500df-0f2a-4e43-8fe7-f4a36dfbd1a2/status","fees":"/items/172500df-0f2a-4e43-8fe7-f4a36dfbd1a2/fees","transactions":"/items/172500df-0f2a-4e43-8fe7-f4a36dfbd1a2/transactions","wire_details":"/items/172500df-0f2a-4e43-8fe7-f4a36dfbd1a2/wire_details","bpay_details":"/items/172500df-0f2a-4e43-8fe7-f4a36dfbd1a2/bpay_details"}}}