PromisePayDotNet.Tests/Fixtures/items_get_by_id.json

{"items":{"id":"5e81906c-e14b-42a8-952f-4a0d1f1a4bb8","name":"Test Item #1","description":"Test item #1 description","created_at":"2015-08-08T19:48:12.900Z","updated_at":"2015-08-08T19:48:12.900Z","state":"pending","net_amount":1000,"refunded_amount":0,"released_amount":0,"buyer_fees":0,"seller_fees":0,"credit_card_fee":0,"deposit_reference":"9140152057","payment_type_id":2,"status":22000,"amount":1000,"pending_release_amount":0,"promisepay_fee":17,"total_outstanding":1000,"currency":"AUD","payment_method":"pending","buyer_name":"Test Test","buyer_email":"aaa@bbb.com","buyer_country":"AUS","seller_name":"Test Test","seller_email":"fdf58725-96bd-4bf8-b5e6-9b61be20662e@google.com","seller_country":"AUS","related":{"buyers":"ec9bf096-c505-4bef-87f6-18822b9dbf2c","sellers":"fdf58725-96bd-4bf8-b5e6-9b61be20662e"},"links":{"self":"/items/5e81906c-e14b-42a8-952f-4a0d1f1a4bb8","buyers":"/items/5e81906c-e14b-42a8-952f-4a0d1f1a4bb8/buyers","sellers":"/items/5e81906c-e14b-42a8-952f-4a0d1f1a4bb8/sellers","status":"/items/5e81906c-e14b-42a8-952f-4a0d1f1a4bb8/status","fees":"/items/5e81906c-e14b-42a8-952f-4a0d1f1a4bb8/fees","transactions":"/items/5e81906c-e14b-42a8-952f-4a0d1f1a4bb8/transactions","wire_details":"/items/5e81906c-e14b-42a8-952f-4a0d1f1a4bb8/wire_details","bpay_details":"/items/5e81906c-e14b-42a8-952f-4a0d1f1a4bb8/bpay_details"}}}